workstation/tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    XMin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3300;
        startFace       1050780;
    }
    XMax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3300;
        startFace       1054080;
    }
    YMin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11880;
        startFace       1057380;
    }
    YMax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11880;
        startFace       1069260;
    }
    ZMin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3240;
        startFace       1081140;
    }
    ZMax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3240;
        startFace       1084380;
    }
)

// ************************************************************************* //
